import {Link} from "@remix-run/react";
import instructorImg from '../asstes/static/instructor.jpeg';
type instructor = {
    name: string,
    email: string,
    specialization: string,
    about: string,
    linkedin?: string,
    website?: string,
}
export function InstructorsSection () {
    return (
        <div className='bg-white flex flex-col justify-center items-center gap-4 p-4'>
            <p className='text-center text-2xl max-w-sm mx-auto font-bold'>Warith Elevate تعرف على مدربين </p>
            <div className='flex flex-col items-center justify-start xl:justify-around xl:flex-row gap-8 grow'>
                <div className='flex flex-col xl:flex-row items-center justify-center gap-8 xl:gap-4 shadow-lg rounded-lg p-3'>
                    <div className='flex flex-col items-end gap-4 xl:max-w-80'>
                        <p className='font-bold'>احمد علي كاظم</p>
                        <p className='font-light text-sm'>مهندس برمجيات</p>
                        <p className='font-light text-sm text-right'>انضم الينا في رحلة الاكتشاف والتعلم والابتكار، كن جزءا من مجتمع يحتفي بالتطوير، ويتقبل التحديات، ويحول الافكار الى مشاريع ذات تأثير.</p>
                        <div className='flex flex-row gap-2 items-start justify-start w-full'>
                            <Link to={''}>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M12 22C6.477 22 2 17.523 2 12C2 6.477 6.477 2 12 2C17.523 2 22 6.477 22 12C22 17.523 17.523 22 12 22ZM18.355 15.952V15.847C18.355 14.925 18.355 14.504 17.703 14.131C17.4934 14.0122 17.2782 13.9037 17.058 13.806C16.691 13.639 16.448 13.53 16.12 13.05C16.0808 12.993 16.0422 12.9357 16.004 12.878C15.659 12.353 15.41 11.975 14.462 12.125C12.597 12.421 12.459 12.749 12.377 13.303L12.364 13.394C12.243 14.204 12.221 14.476 12.559 14.831C13.824 16.158 14.582 17.115 14.812 17.675C14.924 17.948 15.212 18.775 15.014 19.593C16.2278 19.1095 17.3083 18.3425 18.165 17.356C18.275 16.982 18.355 16.516 18.355 15.952ZM12 3.833C9.683 3.833 7.59 4.799 6.104 6.349C6.281 6.472 6.435 6.645 6.541 6.883C6.745 7.34 6.745 7.811 6.745 8.228C6.745 8.556 6.745 8.868 6.85 9.093C6.994 9.401 7.616 9.533 8.165 9.647C8.362 9.689 8.564 9.731 8.748 9.782C9.254 9.922 9.646 10.377 9.959 10.742C10.089 10.893 10.282 11.116 10.379 11.172C10.429 11.136 10.59 10.961 10.669 10.674C10.731 10.454 10.713 10.26 10.624 10.154C10.064 9.494 10.095 8.224 10.268 7.755C10.54 7.016 11.39 7.071 12.012 7.111C12.244 7.126 12.462 7.141 12.626 7.12C13.248 7.042 13.44 6.095 13.575 5.91C13.867 5.51 14.761 4.907 15.315 4.535C14.2715 4.07099 13.142 3.83181 12 3.833Z"
                                        fill="#213469"/>
                                </svg>
                            </Link>
                            <Link to={''}>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M3 3H21C21.2652 3 21.5196 3.10536 21.7071 3.29289C21.8946 3.48043 22 3.73478 22 4V20C22 20.2652 21.8946 20.5196 21.7071 20.7071C21.5196 20.8946 21.2652 21 21 21H3C2.73478 21 2.48043 20.8946 2.29289 20.7071C2.10536 20.5196 2 20.2652 2 20V4C2 3.73478 2.10536 3.48043 2.29289 3.29289C2.48043 3.10536 2.73478 3 3 3ZM12.06 11.683L5.648 6.238L4.353 7.762L12.073 14.317L19.654 7.757L18.346 6.244L12.06 11.683Z"
                                        fill="#213469"/>
                                </svg>
                            </Link>
                            <Link to={''}>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M18.335 18.339H15.67V14.162C15.67 13.166 15.65 11.884 14.28 11.884C12.891 11.884 12.679 12.968 12.679 14.089V18.339H10.013V9.75H12.573V10.92H12.608C12.966 10.246 13.836 9.533 15.136 9.533C17.836 9.533 18.336 11.311 18.336 13.624V18.339H18.335ZM7.003 8.575C6.79956 8.57526 6.59806 8.53537 6.41006 8.45761C6.22207 8.37984 6.05127 8.26574 5.90746 8.12184C5.76365 7.97793 5.64965 7.80706 5.57201 7.61901C5.49437 7.43097 5.4546 7.22944 5.455 7.026C5.4552 6.71983 5.54618 6.4206 5.71644 6.16615C5.8867 5.91169 6.12859 5.71343 6.41153 5.59645C6.69447 5.47947 7.00574 5.44902 7.30598 5.50894C7.60622 5.56886 7.88196 5.71648 8.09831 5.93311C8.31466 6.14974 8.46191 6.42566 8.52145 6.72598C8.58099 7.0263 8.55013 7.33753 8.43278 7.62032C8.31543 7.9031 8.11687 8.14474 7.86219 8.31467C7.60751 8.4846 7.30917 8.5752 7.003 8.575ZM8.339 18.339H5.666V9.75H8.34V18.339H8.339ZM19.67 3H4.329C3.593 3 3 3.58 3 4.297V19.703C3 20.42 3.594 21 4.328 21H19.666C20.4 21 21 20.42 21 19.703V4.297C21 3.58 20.4 3 19.666 3H19.67Z"
                                        fill="#213469"/>
                                </svg>
                            </Link>
                        </div>
                    </div>
                    <img alt='' src={instructorImg} className='object-cover overflow-hidden h-80 w-72 xl:w-32 xl:h-44'/>
                </div>
            </div>
        </div>
    );
}